import {NOTAM_FIELD, parserNotam, selectFiled} from "./lib/field-parser";

console.log('start !!!')

const notam = `(К3153/19 НОТАМН
Щ)УУВЖ/ЩРТЦА/ИЖ/БО/В/000/120/5612С03709В004
А)УУВЖ Б)1904250300 Ц)1904271100
Д)25 26 0300-2300, 27 0300-1100
Е)ЗАПРЕЩЕНО ИСПОЛЬЗОВАНИЕ ВОЗДУШНОГО ПРОСТРАНСТВА РАЙОН:
560930С0370830В-561048С0370319В-561304С0370248В-561424С0370830В-
561503С0371259В-561324С0371500В-561326С0371113В-561424С0370830В-
560930С0370830В.
Ф)ПОВЕРХНОСТЬ Г)ЭШ120)`;

export {parserNotam, selectFiled} from './lib/field-parser';

const s = parserNotam( notam);
console.log(s);